#include<iostream>
using namespace std;

void main()
{
	setlocale(LC_ALL, "Russian");
	cout << "12345\tHello \"World\"!\n";
	cout << "Привет\n";
	cout << "++\n";
	cout << "\n";
	cout << "\\";
}

//Ctrl + F7 - Компиляция
//Ctrl + F5 - Запуск

/*
------------------------------------------------------------
#include<iostream> Потоки ввода/вывода - cin/cout
# - показывает, что include - это директива.
Директива - это указание компилятору на выполнение некоторых действий.
Директива #include укзывает компилятору на то, что к нашему исходному файлу 
нужно подключить другой файл, в данном случае iostream.

using namespace std; - Говорит компилятору использовать пространство имен std.
В этом именном пространстве объявлены потоки cin/cout.


void main()
main() - это главная функция, которая является точкой входа,
поскольку с нее начинается выполнение любой программы.

void (Пустота) показывает, что функция main() ничего не возвращает по завершении.

cout (Console Out) - это поток вывода на экран. Выводит значения в окно консоли.

<< - оператор перенаправления в поток, перенаправляет значения в поток cout.
------------------------------------------------------------
*/

/*
	Escape-последовательности (Esc)
	
	\ - Backslash (Обратная косая черта)
	/ - Slash (Косая черта)

	\ - это символ отмены специального значения другого символа
	\n - newline, переносит курсор в начало новой строки.
	\t - Tab. Одна табуляция включает в себя до восьми пробелов
*/